const jsonHeroes = `[{ 
    "url": "./img/batman.jpg", 
    "name": "Бэтмен", 
    "alter": "Брюс Уэйн",
    "occupation": "борец с преступностью, филантроп, миллиардер",
    "power": "интеллект, обширные познания, знания боевых искусств, ловкость",
    "description": "по популярности человек-летучая мышь может сравниться только с Суперменом. Его образ кажется очень мистическим и мрачным: черный костюм с развевающимся плащом, устрашающий Бэтмобиль, штаб-квартира в сырой пещере. Его биография настолько же темна, как и образ. В детстве у него на глазах убили родителей, и юный Брюс поклялся всеми силами защищать родной Готэм от преступности. Брюс знаменит, несмотря на пожилой возраст: первый выпуск с его участием вышел аж в 1939 году. С каждым годом популярность только крепнет. Большую роль в этом сыграли экранизации: «Темный рыцарь», сериал «Готэм» и несколько одноименных картин. <br/>Главная причина такой любви среди фанатов — мысль, что каждый может стать Бэтменом. Если подумать, это один из немногих героев, кто добился своего положения за счет ума и упорства, а не за счет мутаций."
},{ 
    "url": "./img/superman.jpg", 
    "name": "Супермен", 
    "alter": "Кларк Кент",
    "occupation": "борец за справедливость",
    "power": "непробиваемость, суперсила, полет, самоисцеление, суперзрение и суперслух, классный костюм",
    "description": "полная противоположность своему противнику Бэтмену. Если Брюс Уэйн был простым человеком и стал героем, то Супермен героем родился, но вынужден был изображать выходца из бедной канзасской семьи. Последний представитель планеты Криптон был отправлен на Землю прямо перед тем, как его родина была уничтожена. Супермен — некий хамелеон от мира комиксов. В своем первом выпуске в 1938 году он был просто человек-огромный мускул, который умел только разбивать стены и выбивать двери. Позднее к его умениям добавилась способность летать. Дальше у многочисленных воплощений Кларка, от подростка в «Тайнах Смоллвиля» до величественного «Человека из стали», разный уровень и количество суперспособностей. Неизменным остается его слабое место — уязвимость к Криптониту, радиоактивному веществу с родной планеты."
},{
    "url": "./img/iron-man.jpg", 
    "name": "Железный человек", 
    "alter": "Тони Старк",
    "occupation": "гений, миллиардер, плейбой, филантроп",
    "power": "высокий уровень интеллекта, широкие познания науки и техники, связь со всемирной паутиной, бронекостюмы",
    "description": "пожалуй, самый популярный современный супергерой. У него много общего с мрачной птицей ночи Бэтменом: оба потеряли родителей в детстве, стали борцами с преступностью без особых сверхсил, невероятно богатые. Только если Бэтменом восхищаются, то Тони Старка — обожают :) То ли дело в шикарной актерской игре Роберта Дауни мл., который выбил роль у Николаса Кейджа и Тома Круза, то ли в хорошо прописанном персонаже. Прототипом для героя послужили Илон Маск и изобретатель Говард Хьюз. Железный Человек не всегда ходил в красном модном костюме: в своих первых версиях 1963 года он был скромного серого цвета. Увы, в киновоплощении бронекостюм даже не из металла — его делали из пластика и стекловолокна."
},{
    "url": "./img/spider-man.jpg", 
    "name": "Человек-паук", 
    "alter": "Питер Паркер",
    "occupation": "борец за справедливость, студент, фотограф",
    "power": "сверхчеловеческие рефлексы, «паучье чутье», способность прилепляться к твердым поверхностям, производство паутины",
    "description": "Человек-паук родился от потребности Marvel Comics создать героя-подростка. Другие супергерои вроде Бэтмена и Супермена — взрослые мужчины, и целевая аудитория не видела в них примеры для подражания. Пятнадцатилетний Питер Паркер дал понять всем тинейджерам Земли, что можно и злодеев уничтожить, и на красавице жениться. Для этого даже не обязательно быть суперкрасавчиком! Всего лишь нужен укус паучка:). Питер не сразу использовал свои силы во благо людей: изначально он хотел делать на них деньги, участвуя в нелегальных боях без правил. Затем его любимый дядя Бен умер от рук грабителя, и подросток поклялся, что очистит свой родной Нью-Йорк ото зла. Однако спустя время подросток понял, что одной клятвы недостаточно и что «с великой силой приходит великая ответственность». Кстати, не все суперсилы у Питера появились за счет мутации: парень самостоятельно взломал технологию Тони Старка, после чего заслужил его признание."
},{
    "url": "./img/captain-america.jpg",
    "name": "Капитан Америка",
    "alter": "Стивен Роджерс",
    "occupation": "суперсолдат",
    "power": "сила, выносливость, бессмертие, быстрая регенерация, мастерство скрытности и боя",
    "description": "Капитан Америка — персонаж, целеноправленно созданный, чтобы воплощать идеалы патриотизма. Потому он был особенно популярный во время Второй мировой войны. В комиксах обращение «Капитан Америка» применяется к любому, кто выбран правительством США. Больше всего оно закрепилось именно за Стивом Роджерсом. Стив родился в 1917 году в семье ирландских эмигрантов Сары и Джозефа Роджерсов. В детстве он был очень слабым юношей и постоянно подвергался насмешкам со стороны других ребят. Ирландские корни давали о себе знать, потому парень от драки не лез. В начале Второй мировой войны Стивен стремился попасть на фронт. Естественно, из-за здоровья ему отказывали. По воле судьбы ему предложили принять участие в секретном оборонном проекте, целью которого было создание суперсолдат. Несмотря на сложности во время эксперимента, результат был успешным. Роджерс превратился из хилого юноши в настоящего Аполлона. Актер Крис Эванс с этой ролью вполне справился:)"
},{
    "url": "./img/thor.jpg",
    "name": "Тор",
    "alter": "нет; полное имя — Тор Одинсон",
    "occupation": "борец за справедливость, скандинавский бог",
    "power": "все, что может бог, плюс молот Мьелнир",
    "description": "персонаж Тора основан на образе одноименного скандинавского бога. Тор во вселенной Marvel — родной сын Одина и древнейшей богини Геи. После рождения сына Один забрал его в Асгард, где растил вместе со своей женой, богиней Фригг. Последнюю Тор всегда считал своей настоящей матерью и лишь много позже узнал правду о своем рождении. Стоит сказать, что до нынешнего Тора в исполнении Криса Хемсворта у супергероя было несколько воплощений. В одном из них он погиб в схватке с мифическим змеем Мидгардом. Это привело к Рагнареку — некоему апокалипсису в скандинавской мифологии."
},{
    "url": "./img/halk.jpg",
    "name": "Халк", 
    "alter": "Брюс Беннер",
    "occupation": "супергерой, борец за справедливость, ученый-биохимик",
    "power": "сверхчеловеческая сила искорость, выносливость, полет",
    "description": "идею создания Халка как персонажа можно отнести к фантастической новелле «Странная история доктора Джекила и мистера Хайда», в которой ученый не может примириться со своим демоническим альтер эго. Прошлое у Халка — хуже некуда: отец Брюса страдал от алкоголизма и приступов ярости, а мать пыталась всеми силами уберечь сына от гнева своего мужа. Она погибла, защищая своего единственного ребенка от его побоев. Пронеся через все детство тяжелый психологический груз, Брюс вырос в чрезвычайно одаренного, но замкнутого юношу. Хотя Брюс не мог уважать отца, но пошел в науке по его стопам и выбрал ядерную физику. Во время эксперимента он ввел себе пробную сыворотку и подверг себя воздействию большого количества гамма-радиации. Беннер превратился в мускулистого неуправляемого гиганта, который крушил все вокруг и не понимал, что происходит. Так имя Халка стало нарицательным для людей, который не могут держать себя в руках."
},{
    "url": "./img/wonder-woman.jpg",
    "name": "Чудо-женщина",
    "alter": "Диана Принс",
    "occupation": "супергероиня, секретарь-референт",
    "power": "сверхчеловеческая сила искорость, выносливость, полет",
    "description": "пора бы разбавить эту мужскую вечеринку по-настоящему крутой девчонкой :) Принцесса-амозонка родилась на мистическом острове Темескира, расположенном в центре Бермудского треугольника, где пропадают самолеты. Свое настоящее имя — Диана — она получила в честь древнегреческой богини охоты, а суперспособности — от богини любви Афродиты. Растили героиню в исключительно женском обществе, поэтому Чудо-женщина часто появляется в культуре как символ феминизма. У Дианы есть супер-снаряжение: лассо истины и тиара. Первое было сковано богом огня Гефестом, и оно никогда не промахивается. Человек, попавший в его петлю, неизбежно расскажет свои секреты, вспомнит забытое и даже подчинится приказам. Тиара же работает как метательное оружие, способное рассечь что угодно. Корона со звездой в центре символизирует патриотизм американской героини и служит стильным аксессуаром :)"
}]`;

let heroes = JSON.parse(jsonHeroes);
console.log(heroes);

function createCardList(container, obj) {
    obj.forEach(item => {
        console.log(item);
        container.append(createCard(item));
    });
}

function createCard(item) {

    const divCard = document.createElement('div');
    divCard.classList.add('card');

    divCard.insertAdjacentHTML('beforeend', `<img class="img" src="${item.url}"></img>`);

    divCard.insertAdjacentHTML('beforeend', `<h2 class="card__name">${item.name}</h2>`);

    divCard.insertAdjacentHTML('beforeend', `<p><span class="bold">Альтер-эго:</span> ${item.alter}</p>`);

    divCard.insertAdjacentHTML('beforeend', `<p><span class="bold">Род деятельности: </span> ${item.occupation}`);

    divCard.insertAdjacentHTML('beforeend', `<p><span class="bold">Суперсилы: </span> ${item.power}`);

    divCard.insertAdjacentHTML('beforeend', `<p><span class="bold">Подробнее: </span> ${item.description}`);

    return divCard;
}

let container = document.querySelector('.cards-container');

createCardList(container, heroes);
